tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
/* Copyright (c) 2012 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 *
 * @defgroup ble_app_bluetrack_main main.c
 * @{
 * @ingroup ble_app_bluetrack
 * @brief BlueTrack Hub project main file.
 *
 * This file contains the implementation for the BlueTrack Hub. This implementation
 * receives configuration, relay, and DCC commands through the BlueTrack BLE service,
 * and forwards these commands to the appropriate outputs.
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
//#include "nrf_gpio.h"
//#include "nrf51_bitfields.h"
#include "ble.h"
#include "ble_err.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "boards.h"
#include "app_scheduler.h"
//#include "softdevice_handler.h"
#include "app_timer.h"
//#include "ble_error_log.h"
//#include "ble_debug_assert_handler.h"
//#include "pstorage.h"
#include "ble_bluetrack.h"
#include "ble_dis.h"
//#include "app_util_platform.h"
//#include "app_uart.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "nrf_pwr_mgmt.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "gatts_cache_manager.h"

#define DREKKER_DEVELOPMENT_COMPANY_IDENTIFIER 0x0343                               /**< Assigned by Bluetooth SIG. */            

//#define DCC_COMMAND_PROG_PIN_NO         0                                           /**< Set DCC Command Pin Number when Programming Track selected to output P0.0 */
//#define LPCOMP_ADC_INPUT_PIN_NO         1                                           /**< Note LPCOMP/ADC Input Pin Number is output P0.1 */
//#define BRAKE_PIN_NO                    2                                           /**< Set Brake Pin Number to output P0.2 */
//#define THERMAL_PIN_NO                  3                                           /**< Set Thermal Pin Number to output P0.3 */
//#define OVERLOAD_LED_PIN_NO             4                                           /**< Set Overload LED Pin Number to output P0.4 */
//#define BLE_LED_PIN_NO                  5                                           /**< Set BLE LED Pin Number to output P0.5; flashes while advertising, solid when connected */
//#define PROGRAMMING_LED_PIN_NO          6                                           /**< Set Programming LED PIN Number to output P0.6 */
//#define DCC_COMMAND_PIN_NO              7                                           /**< Set DCC Command Pin Number to output P0.7 */
//#define UART_RTS                        8                                           /**< Debug UART RTS pin. Corresponds to Segger UART interface. */
//#define UART_TX                         9                                           /**< Debug UART TX pin. Corresponds to Segger UART interface. */
//#define UART_CTS                        10                                          /**< Debug UART CTS pin. Corresponds to Segger UART interface. */
//#define UART_RX                         11                                          /**< Debug UART RX pin. Corresponds to Segger UART interface. */
//#define OUTPUT_OFFSET                   12                                          /**< Start relay address at output P0.12; relay outputs go to P0.25 */
//#define N_OUTPUTS                       14                                          /**< Number of relay outputs */
                                                                                    /**< P0.26 and P0.27 are used by the LFCLK */
//#define SYNC_PIN_NO                     28                                          /**< Set Sync Pin Number to output P0.28 (this is shared with the DFU button) */
//#define STOP_LED_PIN_NO                 29                                          /**< Set Stop LED Pin Number to output P0.29 */

//#define ADC_DELTA                       20                                          /**< ADC value above the baseline required to trigger an acknowledge */
                                                                                    /* 10 bit ADC, 1.2V bandgap reference, and 1.74kohm sense resistor gives the following resolutions:
                                                                                     300uA/A (min) sensitivity - 1.497mA
                                                                                     377uA/A (nom) sensitivity - 1.786mA
                                                                                     450uA/A (max) sensitivity - 2.245mA
                                                                                     
                                                                                     20 counts above baseline gives the following deltas:
                                                                                     300uA/A (min) sensitivity - 29.933mA
                                                                                     377uA/A (nom) sensitivity - 35.729mA
                                                                                     450uA/A (max) sensitivity - 44.899mA
                                                                                     
                                                                                     This allows detection of the minimum 60mA delta specified in S-9.2.3 */

//#define MIN_DCC_LEN                     2                                           /**< Minimum length (in bytes) of a DCC command (excluding error byte, see S-9.2.1) */
//#define MAX_DCC_LEN                     5                                           /**< Maximum length (in bytes) of a DCC command (excluding error byte, see S-9.2.1) */

//#define TIMER1_IRQ_PRI                  APP_IRQ_PRIORITY_HIGH                       /**< Set priority of DCC timer to application high */
//#define TIMER1_PRESCALER_VAL            0                                           /**< Set base period to 62.5ns */
//#define DCC_ONE_CC_VAL                  928                                         /**< 928 * 62.5ns = 58us (see S-9.1) */
//#define DCC_ZERO_CC_VAL                 1600                                        /**< 1600 * 62.5ns = 100us (see S-9.1) */

//#define TIMER2_PRESCALER_VAL_LED        7                                           /**< Set base period to 80us when driving an LED */
//#define TIMER2_PRESCALER_VAL_DCC        TIMER1_PRESCALER_VAL                        /**< Set base period to 62.5ns when driving the programming DCC output */
//#define TIMER2_CC_VAL_LED               62500                                       /**< 62500 * 80us = 500ms (advertising LED toggles every 500ms) */

