tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
//#define LPCOMP_IRQ_PRI                  APP_IRQ_PRIORITY_HIGH                       /**< Set priority of comparator to application high */

//#define GPIOTE_IRQ_PRI                  APP_IRQ_PRIORITY_HIGH                       /**< Set priority of GPIOTE to application high */

//#define ADC_IRQ_PRI                     APP_IRQ_PRIORITY_HIGH                       /**< Set priority of ADC to application high */

//#define UART_IRQ_PRI                    APP_IRQ_PRIORITY_LOW                        /**< Set priority of UART to application low */

//#define UART_FIFO_TX_SIZE               128                                         /**< UART TX FIFO size (must be power of 2) */
//#define UART_FIFO_RX_SIZE               128                                         /**< UART RX FIFO size (must be power of 2) */

//#define DCC_COMMAND_BUFFER_SIZE         52                                          /**< Size of DCC Command buffer, this is 32+20 for worst case service mode*/

//#define ACTUATION_INTERVAL              1000                                        /**< Relay actuation interval (ms) (1s seems reasonable to guarantee actuation) */

//#define ADC_SAMPLE_INTERVAL             0.5                                         /**< ADC sample interval (ms) (this allows at least 10 samples during a minimum 5ms feedback window, see S-9.2.3) */

//#define FUNCTION_READ_BIT               1                                           /**< Enum for read_bit function */
//#define FUNCTION_READ_BYTE              2                                           /**< Enum for read_byte function */
//#define FUNCTION_WRITE_BIT              3                                           /**< Enum for write_bit function */
//#define FUNCTION_WRITE_BYTE             4                                           /**< Enum for write_byte function */
//#define MODE_DIRECT                     1                                           /**< Enum for direct mode */
//#define MODE_PAGED                      2                                           /**< Enum for paged mode */
//#define MODE_REGISTER                   3                                           /**< Enum for register mode */
//#define MODE_ADDRESS                    4                                           /**< Enum for address mode */
//#define READ_BYTE_COUNTER_MAX           255                                         /**< Maximum value for the read byte counter (maximum value of 8 bit unsigned integer) */
//#define READ_BIT_COUNTER_MAX            7                                           /**< Maximum value for the read bit counter (8-1) */
//#define READ_BIT_COUNTER_MAX_ADDRESS    127                                         /**< Maximum value for the read byte counter when in address mode (short address cannot be greater than 127) */

//#define ADDRESS_TYPE_INVALID            0                                           /**< Enum for invalid address type */
//#define ADDRESS_TYPE_BROADCAST          1                                           /**< Enum for broadcast address type */
//#define ADDRESS_TYPE_SHORT_CONSIST      2                                           /**< Enum for short or consist address type */
//#define ADDRESS_TYPE_LONG               3                                           /**< Enum for long address type */
//
//#define COMMAND_REPEATS                 10                                          /**< Number of times to repeat a DCC command (arbitrary selection) */
//
//#define SPEED_COMMAND_ARRAY_SIZE        128                                         /**< Number of addresses we can store a speed command for. This places a limitation on the number of trains we can concurrently support. */
//
//#define MAIN                            0                                           /**< Indicates DCC commands are sent to the main track. */
//#define PROGRAMMING                     1                                           /**< Indicates DCC commands are sent to the programming track. */
//#define MAIN_REPEAT                     2                                           /**< Indicates repeating DCC commands are being sent to the main track in programming mode */

#define DEVICE_NAME                     "BlueTrack"                                /**< Name of device. Will be included in the advertising data. Limit length to 11 to allow Master Emulator to connect (unexplained). */

#define MODEL_NUMBER                    "BlueTrack Hub"                            /**< Model number for DIS. **/
#define MANUFACTURER_NAME               "Drekker Development Pty. Ltd."            /**< Manufacturer name for DIS. **/

#define APP_BLE_OBSERVER_PRIO           3                                          /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_BLE_CONN_CFG_TAG            1                                          /**< A tag identifying the SoftDevice BLE configuration. */

#define APP_ADV_INTERVAL                MSEC_TO_UNITS(20, UNIT_0_625_MS )          /**< The advertising interval, 20ms recommended by R12 of Accessory Design Guidelines for Apple Devices */
#define APP_ADV_DURATION                BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED      /**< Advertising duration in 10 ms units. */

//#define APP_TIMER_PRESCALER             0                                           /**< Value of the RTC1 PRESCALER register (no prescaling, maximum resolution). */
//#define APP_TIMER_MAX_TIMERS            3                                           /**< Maximum number of simultaneously created timers (only output timer and feedback timer). */
//#define APP_TIMER_OP_QUEUE_SIZE         4                                           /**< Size of timer operation queues (only output timer and feedback timer, + 1 for how the queue is implemented). */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(510, UNIT_1_25_MS)            /**< Minimum acceptable connection interval (0.51 seconds to comply with R12 of Accessory Design Guidelines for Apple Devices). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(1000, UNIT_1_25_MS)           /**< Maximum acceptable connection interval (1 second). */
#define SLAVE_LATENCY                   0                                           /**< Slave latency (0 to comply with R12 of Accessory Design Guidelines for Apple Devices). */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds to comply with R12 of Accessory Design Guidelines for Apple Devices). */

