tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
/**@brief Function for identifying an appropriate index for a periodic speed command. Returns SPEED_COMMAND_ARRAY_SIZE if full.
 */
//static uint8_t index_for_periodic_speed_command(uint8_t address_type, uint16_t address)
//{
//    uint8_t i;
//    uint8_t vacant = SPEED_COMMAND_ARRAY_SIZE;
//    for (i = 0; i < SPEED_COMMAND_ARRAY_SIZE; i++)
//    {
//        if (speed_command_address_type[i] == ADDRESS_TYPE_INVALID)
//        {
//            // We've found a vacant index, store it
//            vacant = i;
//        }
//        else if ((speed_command_address_type[i] == address_type) && (speed_command_address[i] == address))
//        {
//            // We've found a corresponding entry
//            return i;
//        }
//    }
//    
//    // We made it here without finding a corresponding entry, simply return vacant
//    return vacant;
//}


/**@brief Function for handling a write to the Address characteristic.
 *
 * @details This function enqueues the written address for relay actuation, providing it is in range.
 *
 * @param[in]   p_bluetrack    BlueTrack service structure.
 * @param[in]   address        Address of relay output to be actuated.
 */
static void address_write_handler(ble_bluetrack_t * p_bluetrack, uint8_t address)
{
    NRF_LOG_INFO("Address Written");

//    UNUSED_VARIABLE(p_bluetrack);
//
//    // First check address is in range.
//    if (address < N_OUTPUTS)
//    {
//        // Raise flag for actuation
//        output_flags[address] = true;
//    }
}


/**@brief Function for enqueing a DCC command.
 *
 * @details This function places the DCC Command on the buffer, encoding it appropriately. It will silently drop the command if there is insufficient space in the buffer. As a convenience, it will also return the enqueued command by reference (with the occupied flag UNSET).
 *
 * @param[in]   byte1          byte1 of DCC command.
 * @param[in]   byte2          byte2 of DCC command.
 * @param[in]   byte3          byte3 of DCC command.
 * @param[in]   byte4          byte4 of DCC command.
 * @param[in]   byte5          byte5 of DCC command.
 * @param[in]   byte6          byte6 of DCC command.
 * @param[in]   len            Length of DCC command in bytes.
 * @param[in]   feedback       Flag to indicate whether a feedback window should be opened for this command.
 */
//static void enqueue_dcc_command (uint8_t byte1, uint8_t byte2, uint8_t byte3, uint8_t byte4, uint8_t byte5, uint8_t len, uint8_t feedback, dcc_command_t *enqueued_command)
//{
//    uint8_t next_producer_index;
//    
//    // First check for valid length
//    if (len >= MIN_DCC_LEN && len <= MAX_DCC_LEN)
//    {
//        next_producer_index = producer_index + 1;
//        // Reset next producer index if we have overflowed
//        if (next_producer_index == DCC_COMMAND_BUFFER_SIZE)
//        {
//            next_producer_index = 0;
//        }
//        
//        // Only transmit if we have enough room to move to the next slot
//        if (next_producer_index != consumer_index)
//        {
//            // Send a DCC packet (long preamble (20 bits) used to satisfy S-9.2.3)
//            if (len == 2)
//            {
//                dcc_command_buffer[producer_index].data0 = 0xFFFFF000 | (byte1 << 3);
//                dcc_command_buffer[producer_index].data0_count = 30;
//                dcc_command_buffer[producer_index].data1 = 0x00004000 | (byte2 << 24) | ((byte1 ^ byte2) << 15);
//                dcc_command_buffer[producer_index].data1_count = 18;
//                dcc_command_buffer[producer_index].data2 = 0x80000000;
//                dcc_command_buffer[producer_index].data2_count = 1;
//            }
//            else if (len == 3)
//            {
//                dcc_command_buffer[producer_index].data0 = 0xFFFFF000 | (byte1 << 3);
//                dcc_command_buffer[producer_index].data0_count = 30;
//                dcc_command_buffer[producer_index].data1 = 0x00000020 | (byte2 << 24) | (byte3 << 15) | ((byte1 ^ byte2 ^ byte3) << 6);
//                dcc_command_buffer[producer_index].data1_count = 27;
//                dcc_command_buffer[producer_index].data2 = 0x80000000;
//                dcc_command_buffer[producer_index].data2_count = 1;
//            }
//            else if (len == 4)
//            {
//                dcc_command_buffer[producer_index].data0 = 0xFFFFF000 | (byte1 << 3);
//                dcc_command_buffer[producer_index].data0_count = 30;
//                dcc_command_buffer[producer_index].data1 = 0x00000000 | (byte2 << 24) | (byte3 << 15) | ((byte4) << 6);
//                dcc_command_buffer[producer_index].data1_count = 27;
//                dcc_command_buffer[producer_index].data2 = 0x00800000 | ((byte1 ^ byte2 ^ byte3 ^ byte4) << 24);
//                dcc_command_buffer[producer_index].data2_count = 9;
//            }
//            else if (len == 5)
//            {
//                dcc_command_buffer[producer_index].data0 = 0xFFFFF000 | (byte1 << 3);
//                dcc_command_buffer[producer_index].data0_count = 30;
//                dcc_command_buffer[producer_index].data1 = 0x00000000 | (byte2 << 24) | (byte3 << 15) | ((byte4) << 6);
//                dcc_command_buffer[producer_index].data1_count = 27;
//                dcc_command_buffer[producer_index].data2 = 0x00004000 | (byte5 << 24) | ((byte1 ^ byte2 ^ byte3 ^ byte4 ^ byte5) << 15);
//                dcc_command_buffer[producer_index].data2_count = 18;
//            }
//            
//            dcc_command_buffer[producer_index].sync = true;
//            dcc_command_buffer[producer_index].feedback = feedback ? true : false;
//            
//            // Return by reference, if required
//            if (enqueued_command != NULL)
//            {
//                memcpy(enqueued_command, &dcc_command_buffer[producer_index], sizeof(dcc_command_t));
//            }
//            
//            dcc_command_buffer[producer_index].occupied = true;
//            
//            // Advance producer index
//            producer_index = next_producer_index;
//        }
//    }
//}


/**@brief Function for enqueing a DCC command from the scheduler.
 *
 * @details This function calls enqueue_dcc_command.
 *
 * @param[in]   p_event_data   Pointer to scheduled_dcc_command data type.
 * @param[in]   event_size     Size of scheduled_dcc_command.
 */
//void enqueue_dcc_command_from_scheduler (void *p_event_data, uint16_t event_size)
//{
//    uint8_t i;
//    uint16_t address = 0;
//    uint8_t address_type = ADDRESS_TYPE_INVALID;
//    uint8_t command_byte, data_byte;
//    uint8_t index;
//    dcc_command_t speed_command;
//    scheduled_dcc_command_t *p_scheduled_dcc_command;
//    
//    if (event_size == sizeof(scheduled_dcc_command_t))
//    {
//        p_scheduled_dcc_command = (scheduled_dcc_command_t *)p_event_data;
//        
//        // We send the command first to get a copy of the enqueued packet for the periodic speed command. We think we can do this because we assume this function will purge the periodic speed command array before the sent command (and its repetitions) makes it out on the rails, so if a stop is sent, the previous periodic speed command for that address will be purged before the DCC timer handler gets around to pulling it from the periodic speed command array after it clears the DCC buffer.
//        
//        // Repeat the command as required
//        for (i = 0; i < COMMAND_REPEATS; i++)
//        {
//            enqueue_dcc_command(p_scheduled_dcc_command->byte1, p_scheduled_dcc_command->byte2, p_scheduled_dcc_command->byte3, p_scheduled_dcc_command->byte4, p_scheduled_dcc_command->byte5, p_scheduled_dcc_command->len, p_scheduled_dcc_command->feedback, &speed_command);
//        }
//        
//        // If we have a reset or hard reset packet in operations mode sent to broadcast, short, or long addresses, queue up 10 idle packets to ensure the decoders don't enter service mode unintentionally
//        if (((p_scheduled_dcc_command->byte1 <= 127) && ((p_scheduled_dcc_command->byte2 == 0x00) || (p_scheduled_dcc_command->byte2 == 0x01))) ||
//            ((p_scheduled_dcc_command->byte1 >= 192) && (p_scheduled_dcc_command->byte1 <= 231) && ((p_scheduled_dcc_command->byte3 == 0x00) || (p_scheduled_dcc_command->byte3 == 0x01))))
//        {
//            for (i = 0; i < 10; i++)
//            {
//                enqueue_dcc_command(0xFF, 0, 0, 0, 0, 2, 0, NULL);
//            }
//        }
//        
//        // Only update the periodic speed commands when we are in main track mode
//        if (programming_track_mode == MAIN)
//        {
//            // First identify the address (if valid)
//            if (p_scheduled_dcc_command->byte1 == 0)
//            {
//                address_type = ADDRESS_TYPE_BROADCAST;
//                address = p_scheduled_dcc_command->byte1;
//                command_byte = p_scheduled_dcc_command->byte2;
//                data_byte = p_scheduled_dcc_command->byte3;
//            }
//            else if ((p_scheduled_dcc_command->byte1 >= 1) && (p_scheduled_dcc_command->byte1 <= 127))
//            {
//                address_type = ADDRESS_TYPE_SHORT_CONSIST;
//                address = p_scheduled_dcc_command->byte1;
//                command_byte = p_scheduled_dcc_command->byte2;
//                data_byte = p_scheduled_dcc_command->byte3;
//            }
//            else if ((p_scheduled_dcc_command->byte1 >= 192) && (p_scheduled_dcc_command->byte1 <= 231))
//            {
//                address_type = ADDRESS_TYPE_LONG;
//                address = ((p_scheduled_dcc_command->byte1 & 0x3F) << 8) | p_scheduled_dcc_command->byte2;
//                command_byte = p_scheduled_dcc_command->byte3;
//                data_byte = p_scheduled_dcc_command->byte4;
//            }
//            
//            // Now check if we have a speed command
//            if (address_type != ADDRESS_TYPE_INVALID)
//            {
//                if (((command_byte == 0x3F) && ((data_byte & 0x7E) == 0)) || (((command_byte & 0xC0) == 0x40) && ((command_byte & 0x0E) == 0)))
//                {
//                    // We have a 128 step speed command or a 28 step speed command which is a stop or emergency stop
//                    if (address_type == ADDRESS_TYPE_BROADCAST)
//                    {
//                        // For a broadcast command, wipe the periodic speed commands
//                        remove_all_speed_commands();
//                    }
//                    else
//                    {
//                        // We only neeed to wipe the command of the affected address
//                        index = index_for_periodic_speed_command(address_type, address);
//                        if (index != SPEED_COMMAND_ARRAY_SIZE)
//                        {
//                            // We are safe to wipe a vacant location, if that is what was returned
//                            speed_command_array[index].occupied = false;
//                            speed_command_array_temp[index].occupied = false;
//                            speed_command_address_type[index] = ADDRESS_TYPE_INVALID;
//                        }
//                    }
//                }
//                else if (((command_byte == 0x3F) && ((data_byte & 0x7E) != 0)) || (((command_byte & 0xC0) == 0x40) && ((command_byte & 0x0E) != 0)))
//                {
//                    // We have a 128 step speed command or a 28 step speed command which is a speed command
//                    // Note we do this for all address types, including broadcast; the logic here is if someone is silly enough to do a broadcast speed command, it should still be periodicallly repeated
//                    index = index_for_periodic_speed_command(address_type, address);
//                    if (index != SPEED_COMMAND_ARRAY_SIZE)
//                    {
//                        // We are safe to add/overwrite
//                        speed_command_address_type[index] = address_type;
//                        speed_command_address[index] = address;
//                        speed_command_array[index].occupied = false;
//                        speed_command_array_temp[index].occupied = false;
//                        memcpy(&speed_command_array[index], &speed_command, sizeof(dcc_command_t));
//                        memcpy(&speed_command_array_temp[index], &speed_command, sizeof(dcc_command_t));
//                        speed_command_array[index].occupied = true;
//                        speed_command_array_temp[index].occupied = true;
//                    }
//                    else
//                    {
//                        // There was not enough room in the array, raise an error
//                        disable_DCC(ERROR_CODE_MAX_TRAIN_EXCEEDED);
//                    }
//                }
//            }
//        }
//    }
//    else
//    {
//        APP_ERROR_CHECK(NRF_ERROR_INVALID_LENGTH);
//    }
//}


/**@brief Function for handling a write to the DCC Command characteristic.
 *
 * @details This function places the DCC Command on the buffer, encoding it appropriately. It will silently drop the command if there is insufficient space in the buffer.
 *
 * @param[in]   p_bluetrack    BlueTrack service structure.
 * @param[in]   byte1          byte1 of DCC command (MSB).
 * @param[in]   byte2          byte2 of DCC command.
 * @param[in]   byte3          byte3 of DCC command.
 * @param[in]   byte4          byte4 of DCC command.
 * @param[in]   byte5          byte5 of DCC command.
 * @param[in]   byte6          byte6 of DCC command.
 * @param[in]   len            Length of DCC command in bytes.
 * @param[in]   feedback       Flag to indicate whether a feedback window should be opened for this command (LSB).
 */
static void dcc_command_write_handler(ble_bluetrack_t * p_bluetrack, uint8_t byte1, uint8_t byte2, uint8_t byte3, uint8_t byte4, uint8_t byte5, uint8_t len)
{
    NRF_LOG_INFO("DCC Command Written");

//    scheduled_dcc_command_t scheduled_dcc_command;
//    uint32_t err_code;
//    UNUSED_VARIABLE(p_bluetrack);
//    
//    // Only schedule the enqueue of the command if we have no service command pending or in progress
//    if (!service_command_pending && !service_command_in_progress)
//    {
//        scheduled_dcc_command.byte1 = byte1;
//        scheduled_dcc_command.byte2 = byte2;
//        scheduled_dcc_command.byte3 = byte3;
//        scheduled_dcc_command.byte4 = byte4;
//        scheduled_dcc_command.byte5 = byte5;
//        scheduled_dcc_command.len = len;
//        scheduled_dcc_command.feedback = 0;
//        
//        err_code = app_sched_event_put(&scheduled_dcc_command, sizeof(scheduled_dcc_command_t), enqueue_dcc_command_from_scheduler);
//        APP_ERROR_CHECK(err_code);
//    }
}


