tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
/**@brief Function for initializing the ADC module.
*/
//static void adc_init(void)
//{
//    // Select P0.1 as the ADC input (ADC can be used concurrently with the LPCOMP provided the input is the same), 1.2V bandgap as reference, no prescaling, and 10 bit resolution
//    NRF_ADC->CONFIG = (
//                       (ADC_CONFIG_EXTREFSEL_None << ADC_CONFIG_EXTREFSEL_Pos) |
//                       (ADC_CONFIG_PSEL_AnalogInput2 << ADC_CONFIG_PSEL_Pos) |
//                       (ADC_CONFIG_REFSEL_VBG << ADC_CONFIG_REFSEL_Pos) |
//                       (ADC_CONFIG_INPSEL_AnalogInputNoPrescaling << ADC_CONFIG_INPSEL_Pos) |
//                       (ADC_CONFIG_RES_10bit << ADC_CONFIG_RES_Pos)
//                      );
//    // Allow END event to trigger an interrupt
//    NRF_ADC->INTENSET = ADC_INTENSET_END_Msk;
//    // Finally, turn on the ADC
//    NRF_ADC->ENABLE = ADC_ENABLE_ENABLE_Enabled;
//
//    // Register ADC interrupt with softdevice
//    NVIC_SetPriority(ADC_IRQn, ADC_IRQ_PRI);
//    NVIC_ClearPendingIRQ(ADC_IRQn);
//    NVIC_EnableIRQ(ADC_IRQn);
//}


/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}


/**@brief Function for initializing BlueTrack data structures.
 */
//static void bluetrack_init(void)
//{
//    uint32_t i;
//
//    // Populate index array and initialise flags
//    for(i = 0; i < (N_OUTPUTS); i++)
//    {
//        output_index[i] = i + OUTPUT_OFFSET;
//        output_flags[i] = false;
//    }
//
//    // Clear buffer
//    memset(dcc_command_buffer, 0, sizeof(dcc_command_buffer));
//    
//    // Clear idle memory
//    memset(&idle_packet, 0, sizeof(idle_packet));
//
//    // Set indexes and phases
//    producer_index = 0;
//    consumer_index = 0;
//    phase1_complete = true;
//    phase2_complete = false;
//
//    // We start with no pending speed commands
//    remove_all_speed_commands();
//    active_speed_command_index = 0;
//    
//    // Send ones at the start
//    dcc_output_state = true;
//
//    // We start off with DCC enabled
//    dcc_disabled = false;
//
//    // We start of with feedback not in progress
//    feedback_in_progress = false;
//
//    // We start off with the main track selected
//    programming_track_mode = MAIN;
//    programming_track_state = MAIN;
//    
//    // We start off with no service command pending
//    service_command_pending = false;
//    
//    // We start off with no service command in progress
//    service_command_in_progress = false;
//    
//    // We do not send 20 reset packets and 10 idle packets, as suggested by S-9.2.4
//}


/**@brief Function for starting timers.
*/
//static void timers_start(void)
//{
//    uint32_t err_code;
//
//    // Start relay timer
//    err_code = app_timer_start(output_timer, APP_TIMER_TICKS(ACTUATION_INTERVAL, APP_TIMER_PRESCALER), NULL);
//    APP_ERROR_CHECK(err_code);
//
//    // Start DCC output timer
//    NRF_TIMER1->TASKS_START = 1;
//    
//    // Start LED and programming DCC output timer
//    NRF_TIMER2->TASKS_START = 1;
//}


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;
    ble_gap_addr_t          address;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    ret_code_t               err_code;
    ble_advdata_t            advdata;
    ble_advdata_t            srdata;
    ble_gap_adv_params_t     adv_params;
    ble_advdata_manuf_data_t manuf_data;
    uint32_t                 deviceID[2];
    uint8_t                  identifier[12];
    uint32_t                 firmware_version;
    ble_uuid_t adv_uuids[] = {{BLUETRACK_UUID_SERVICE, m_bluetrack.uuid_type}};

    // Retrieve firmware version from UICR, CUSTOMER[0] stores the application version. */
    firmware_version = NRF_UICR->CUSTOMER[0];
    
    // Construct manufacturing data
    manuf_data.company_identifier = DREKKER_DEVELOPMENT_COMPANY_IDENTIFIER;

    deviceID[0] = NRF_FICR->DEVICEID[0];
    deviceID[1] = NRF_FICR->DEVICEID[1];

    NRF_LOG_INFO("deviceID[0] = 0x%x, deviceID[1] = 0x%x", deviceID[0], deviceID[1]);

    // Make everything little endian
    identifier[0] = firmware_version & 0xFF;
    identifier[1] = (firmware_version >> 8) & 0xFF;
    identifier[2] = (firmware_version >> 16) & 0xFF;
    identifier[3] = (firmware_version >> 24) & 0xFF;
    identifier[4] = deviceID[0] & 0xFF;
    identifier[5] = (deviceID[0] >> 8) & 0xFF;
    identifier[6] = (deviceID[0] >> 16) & 0xFF;
    identifier[7] = (deviceID[0] >> 24) & 0xFF;
    identifier[8] = deviceID[1] & 0xFF;
    identifier[9] = (deviceID[1] >> 8) & 0xFF;
    identifier[10] = (deviceID[1] >> 16) & 0xFF;
    identifier[11] = (deviceID[1] >> 24) & 0xFF;

    manuf_data.data.p_data = identifier;
    manuf_data.data.size = sizeof(identifier);

    // Build and set advertising data
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE; // Set this as we advertise for an unlimited time
    advdata.p_manuf_specific_data   = &manuf_data;
    
    // Build and set scan response data
    memset(&srdata, 0, sizeof(srdata));
    srdata.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
    srdata.uuids_complete.p_uuids  = adv_uuids;

